# ####################################################################

#  Created by Genus(TM) Synthesis Solution 18.14-s037_1 on Tue Jun 09 12:04:02 CDT 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1.0fF
set_units -time 1000.0ps

# Set the current design
current_design mac_array

create_clock -name "clk" -period 2.0 -waveform {0.0 1.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN1[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN1[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN1[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN1[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN1[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN1[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN1[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN1[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN1[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN1[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN1[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN1[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN2[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN2[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN2[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN2[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN2[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN2[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN2[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN2[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN2[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN2[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN2[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN2[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN2[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN2[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN3[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN3[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN3[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN3[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN3[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN3[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN3[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {IN3[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN3[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN3[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN3[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN3[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN3[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN3[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN3[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {IN3[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W1[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W1[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W1[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W1[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W1[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W1[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W1[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W1[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W1[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W1[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W1[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W1[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W2[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W2[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W2[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W2[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W2[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W2[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W2[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W2[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W2[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W2[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W2[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W2[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W2[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W2[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W3[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W3[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W3[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W3[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W3[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W3[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W3[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {W3[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W3[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W3[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W3[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W3[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W3[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W3[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W3[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {W3[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT1[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT1[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT2[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT2[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT3[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT3[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT4[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT4[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT5[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT5[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT6[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT6[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT7[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT7[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT8[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT8[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {OUT9[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min -0.2 [get_ports {OUT9[0]}]
set_wire_load_mode "enclosed"
set_dont_use [get_lib_cells NangateOpenCellLibrary/ANTENNA_X1]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X1]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X2]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X4]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X8]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X16]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X32]
set_dont_use [get_lib_cells NangateOpenCellLibrary/LOGIC0_X1]
set_dont_use [get_lib_cells NangateOpenCellLibrary/LOGIC1_X1]
